const window_appData = {};

window_appData.professorsList = [
  "ماهر محمد شریف آدم",
  "د. عمر محمد عبد العال حماد",
  "محمد عبد الرحمن عثمان السيد",
  "كوثر إسحق علي فضل الله",
  "نورة علي عثمان علي",
  "فاطمة الشيخ سيد أحمد خليفة",
  "أنور مصطفى محمد صالح هلال",
  "أحمد إسماعيل محمد إبراهيم",
  "منار أحمد محمد حمزة",
  "سمية محمد الحسن عبد الرحمن حاج سليمان",
  "إبراهيم فضل إبراهيم عثمان",
  "إبراهيم عثمان نوح صالح",
  "بدرالدین حسن الطاهر عبد الكريم",
  "حسين شوقي عمر إبراهيم",
  "عبد الله حمودي الصادق الحاج",
  "زينب محمد الفاتح طه",
  "وعد عامر عباس حمد",
  "عبد الله الأمين عبد الله نور الله",
  "احمد الصادق محمد احمد",
  "الهادي حسن إبراهيم",
  "عبد الودود محمود حسن خيري",
  "مهند عثمان عبد الله صالح",
  "محمد عبد الرحمن محمد منصور",
  "المعتصم عثمان ابنعوف أحمد",
  "صلاح أحمد محمد علي عبد الله",
  "عبد الرحمن على حسن محمد",
  "منهل أحمد محمد حمزه",
  "سارة عبد الرحمن أحمد عبد الرحمن",
  "باسل عبد العظيم",
  "محمد عيسى",
  "الطاهر اللين الطاهر إمام",
  "محاسن موسى محمد عبد الله",
  "أبو علي حامد محمد أونور",
  "ندى عبد الحي عباس كنزي",
  "إسراء خالد إبراهيم الأمين",
  "محمد الشيخ سعيد الشيخ",
  "سوسن محمد عثمان محمد خير",
  "أمل أحمد حسن محمد",
  "زهر الدين الأمين حامد الأمين",
  "سہی فاروق محمد عبد الفتاح",
  "محمد عبدالله عبد الرحيم عبد الله",
  "سنية إبراهيم محجوب ابراهيم",
  "صفاء السيد سعيد أحمد",
  "آمنة الواثق السماني الشيخ محمد",
  "ياسر ابوبكر محمد علوب",
  "سيف النصر خوجلي عبدالله خوجلي",
  "آدم الطيب حماد حامد",
  "أنس حمد النيل الضو عبد الرحيم",
  "مثال آدم الرحيمه ابراهيم",
  "عمر محمد عبد العال حماد",
  "هارون عبد الرسول إبراهيم عليو",
  "ایمن سيد احمد مختار سید احمد",
  "هاشم الأمين سالم أبوزيد",
  "المعز حموده علي حموده",
  "معزه إبراهيم عبد الهادي إبراهيم",
  "ياسين قرشي ياسين الحاج",
  "محمد عمر محمد الحاج",
  "هديل آدم محمد محجوب",
  "ميدوري محمد توت قوز",
  "مزمل حسن يوسف محمد الامين",
  "أسامة الطيب عبد الله أحمد",
  "عبد المنعم إبراهيم آدم",
  "عمار بشير نور الدائم محمد",
  "منزول الصديق الفاضل بابكر",
  "حباب ياسر الوسيله الشيخ"
];

window_appData.programsDict = {
  "بكالوريوس الطب والجراحة": {
    "الطب والجراحة": {
      "الأولى": {
        "الاول": [
          "مدخل لدراسة الطب",
          "الإحصاء الطبي",
          "مقدمة في علم الأوبئة",
          "الفيزياء الطبية",
          "مقدمة الكيمياء العامة والعضوية",
          "الاتصال والمهارات الأساسية",
          "الكيمياء الحيوية",
          "الانسان وبيئته"
        ],
        "الثاني": [
          "التغذية وكيميائها الحيوية",
          "أساسيات علم الوراثة",
          "مقدمة لعلم الطفيليات والحشرات الطبية",
          "علم الأنسجة العام",
          "النمو والتطور",
          "أخلاقيات المهنة الطبية",
          "اساسيات علم الأدوية"
        ]
      },
      "الثانية": {
        "الثالث": [
          "مقدمة لدراسة علم الأمراض",
          "الجهاز الهيكلي العضلي ومشكلاته",
          "أمراض الدم والمناعة",
          "طرق ومناهج البحث العلمي"
        ],
        "الرابع": [
          "الرعاية الصحية الأولية بالمراكز الصحية وطب الأسرة (1)",
          "الجهاز القلبي التنفسي (1)",
          "الجهاز القلبي التنفسي (2)",
          "التدريب الميداني والبحث والتنمية بالقري المرحلة الاولي)"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "الرعاية الصحية الأولية بالمراكز الصحية وطب الأسرة (2)",
          "الجهاز المعدي المعوي ومشكلاته (1)",
          "الجهاز المعدي المعوي ومشكلاته (2)",
          "الغدد الصم والاستقلاب",
          "الأمراض المتوطنة"
        ],
        "السادس": [
          "الادارة الصحية",
          "الجهاز التناسلي البولي ومشكلاته",
          "الجهاز العصبي المركزي ومشكلاته",
          "التدريب الميداني والبحث والتنمية بالقري (المرحلة الثانية)"
        ]
      },
      "الرابعة": {
        "السابع": [
          "الممارسة السريرية في الطب الباطني",
          "الجلدية",
          "الممارسة السريرية في الصحة النفسية",
          "مشروع بحثي"
        ],
        "الثامن": [
          "الممارسة السريرية في أمراض النساء والتوليد",
          "الطب الشرعي",
          "طب الطوارئ",
          "علم الأشعة"
        ]
      },
      "الخامسة": {
        "التاسع": [
          "الممارسة السريرية في طب الأطفال وصحة الطفولة",
          "علم الأورام",
          "الاقامة الريفية"
        ],
        "العاشر": [
          "الممارسة السريرية في الجراحة",
          "جراحة العظام",
          "التخدير والعناية المركزة",
          "الاذن والانف والحنجرة والعيون"
        ]
      }
    }
  },
  "دبلوم الإعلام والوسائط المتعددة": {
    "الإعلام والوسائط المتعددة": {
      "الأولى": {
        "الأول": [
          "لغة إنجليزية 1",
          "تطبيقات الحاسوب 1",
          "مدخل للصحافة",
          "مدخل للإذاعة والتلفزيون",
          "مدخل للعلاقات العامة",
          "المدخل للوسائط المتعددة"
        ],
        "الثاني": [
          "لغة إنجليزية 2",
          "تطبيقات الحاسوب 2",
          "مدخل لعلم الاتصال",
          "تاريخ الإعلام السوداني",
          "الوسائط المتعددة",
          "علم النفس الإعلامي"
        ]
      },
      "الثانية": {
        "الثالث": [
          "تكنولوجيا الإتصال",
          "نظريات الاتصال",
          "الراي العام و الدعاية",
          "الإعلام السياحي",
          "وكالات الأنباء و مصادر المعلومات",
          "الإعلان والتسويق",
          "الإعلام الجديد و تطبيقاته"
        ],
        "الرابع": [
          "اللغة العربية للأغراض الإعلامية",
          "مدخل للترجمة الإعلامية",
          "الإعلام وقضايا المجتمع",
          "سيسلوجيا الاتصال",
          "إدارة المؤسسات الإعلامية",
          "الاتصال التنموي",
          "إقتصاديات الإعلام"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "تقانة الأستديوهات و البث",
          "النشر الالكتروني",
          "مناهج البحث",
          "تصميم المواقع الإذاعية",
          "تخطيط و إنتاج البرامج التلفزيونية",
          "الكتابة للراديو و التلفزيون",
          "فن الالقاء الإذاعي و التلفزيوني",
          "الرسوم المتحركة"
        ],
        "السادس": [
          "المراسم و البروتكول",
          "أسس المونتاج الرقمي",
          "التخطيط للعلاقات العامة",
          "بحوث العلاقات العامة",
          "تكنلوجيا الطباعة و الصحافة",
          "النمذجة و التصميم ثلاثي البعد",
          "مشروع التخرج"
        ]
      }
    }
  },
  "دبلوم المحاسبة": {
    "محاسبة": {
      "الأولى": {
        "الأول": [
          "مبادئ القانون",
          "مقدمة في الحاسوب",
          "اللغة الإنجليزية 1",
          "رياضيات الأعمال 1",
          "مبادئ الاقتصاد",
          "المحاسبة المالية 1",
          "مبادئ الإدارة"
        ],
        "الثاني": [
          "مبادئ التأمين",
          "مبادئ الإحصاء",
          "اللغة الإنجليزية 2",
          "المحاسبة المالية 2",
          "الاقتصاد الجزئي",
          "تطبيقات الحاسوب",
          "رياضيات الأعمال 2"
        ]
      },
      "الثانية": {
        "الثالث": [
          "نظم المعلومات الإدارية",
          "أخلاقيات العمل والمسؤولية الاجتماعية",
          "السلوك التنظيمي",
          "المحاسبة المتوسطة",
          "الاقتصاد الكلي",
          "الإحصاء الإداري"
        ],
        "الرابع": [
          "الإحصاء التطبيقي",
          "القانون التجاري",
          "فقه المعاملات",
          "مبادئ التكاليف",
          "النقود والبنوك",
          "محاسبة الشركات",
          "مهارات المقال وكتابة التقارير"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "المحاسبة المتقدمة",
          "الإدارة المالية",
          "مبادئ المراجعة",
          "تحليل القوائم المالية",
          "تطبيقات الحاسوب في المحاسبة",
          "محاسبة المصارف"
        ],
        "السادس": [
          "المعايير المحاسبية",
          "المحاسبة الإلكترونية",
          "اللغة الإنجليزية للأغراض الخاصة",
          "محاسبة الضرائب والزكاة",
          "المحاسبة الإدارية",
          "المحاسبة الحكومية والمنظمات غير هادفة للربح"
        ]
      }
    }
  },
  "بكالوريوس علوم التمريض": {
    "علوم التمريض": {
      "الأولى": {
        "الأول": [
          "اساسيات التمريض 1",
          "المهنية واخلاقيات المهنة",
          "علم التشريح",
          "علم وظائف الاعضاء",
          "الحاسوب",
          "الكيمياء الحيوية",
          "اللغة الانجليزية 1"
        ],
        "الثاني": [
          "اساسيات التمريض 2",
          "تمريض صحة المجتمع 1",
          "علم الاحياء الدقيقة والطفيليات",
          "التغذية",
          "علم النفس",
          "مهارات الاتصال والتواصل",
          "اللغة الانجليزية 2"
        ]
      },
      "الثانية": {
        "الثالث": [
          "علم الامراض",
          "التمريض الباطني للبالغين 1",
          "التمريض الجراحي للبالغين 1",
          "علم الوبائيات",
          "علم الادوية",
          "التغذية العلاجية"
        ],
        "الرابع": [
          "التمريض الباطني للبالغين 2",
          "التمريض الجراحي للبالغين 2",
          "التوجيه والارشاد",
          "علم الاجتماع والاجناس",
          "نظريات التمريض"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "علم الوراثة",
          "تمريض التوليد",
          "تمريض امراض النساء",
          "التعليم في التمريض",
          "اقتصاديات الصحة",
          "المعلوماتية في التمريض"
        ],
        "السادس": [
          "رعاية الطفل",
          "تمريض الاطفال",
          "تمريض الصحة العقلية",
          "رعاية المسنين",
          "الاحصاء الصحي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "تمريض الطواري والحالات الحرجة",
          "الادارة التمريضية",
          "تمريض صحة المجتمع 2",
          "التمريض العدلي",
          "طرائق البحث العلمي"
        ],
        "الثامن": [
          "بحث التخرج",
          "التقوية في التمريض الباطني",
          "التقوية في التمريض الجراحي",
          "التقوية في تمريض التوليد",
          "التقوية في تمريض الاطفال"
        ]
      }
    }
  },
  "بكالوريوس تقانة المعلومات": {
    "تقانة المعلومات": {
      "الأولى": {
        "الأول": [
          "اللغة الإنجليزية (1)",
          "الحسبان",
          "مبادئ علوم الحاسوب",
          "مبادئ التسويق",
          "مبادئ الإدارة",
          "الإحصاء والاحتمالات",
          "مبادئ الاقتصاد",
          "مبادئ المحاسبة"
        ],
        "الثاني": [
          "اللغة الإنجليزية (2)",
          "تطبيقات الحاسوب",
          "الرياضيات المتقطعة",
          "مبادئ البرمجة",
          "إدارة واستخدام نظم التشغيل",
          "مهارات الاتصال في الأعمال",
          "مفاهيم قواعد البيانات"
        ]
      },
      "الثانية": {
        "الثالث": [
          "اللغة الإنجليزية للأغراض التقنية",
          "تصميم النظم الرقمية",
          "أساليب البرمجة",
          "التحليل والتصميم كائني التوجه",
          "إدارة واستخدام شبكات الحاسوب",
          "هندسة البرمجياتI",
          "الوسائط المتعددة"
        ],
        "الرابع": [
          "معمارية وتنظيم الحواسيب",
          "التفاعل بين الإنسان و الحاسوب",
          "هندسة البرمجيات II",
          "مفاهيم أمن الحاسوب",
          "برمجة قواعد البيانات",
          "الحوسبة السحابية",
          "تقنيات الانترنت (1)"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "هياكل البيانات و الخوارزميات",
          "مفاهيم نظم التشغيل",
          "تطبيقات قواعد البيانات",
          "إدارة المشاريع البرمجية",
          "إدارة وتنفيذ أمن المعلومات",
          "تقنيات الانترنت (2)",
          "علم البيانات والبيانات الضخمة",
          "بحوث العمليات"
        ],
        "السادس": [
          "النمذجة والمحاكاة",
          "نظم المشروعات الحاسوبية في المؤسسات",
          "مقدمة للذكاء الاصطناعي",
          "تقنيات شبكات الحاسوب واتصال البيانات",
          "أمن الشبكات",
          "الإحصاء التطبيقي",
          "التجارة الالكترونية"
        ]
      },
      "الرابعة": {
        "السابع": [
          "انترنت الاشياء",
          "تقنيات وبرمجيات الأجهزة المحمولة",
          "التنقيب في البيانات",
          "مناهج البحث العلمي",
          "مقرر مختار  (1)",
          "مقرر مختار  (2)",
          "مشروع التخرج 1"
        ],
        "الثامن": [
          "قضايا معاصرة في تقانة المعلومات",
          "التشفير",
          "مقرر مختار  (3)",
          "مقرر مختار  (4)",
          "أخلاقيات المهنة",
          "مشروع التخرج2"
        ]
      }
    }
  },
  "بكالريوس الشرف في الاعلام": {
    "تخصص العلاقات العامة": {
      "الأولى": {
        "الأول": [
          "لغة إنجليزية 1",
          "تطبيقات الحاسوب 1",
          "مدخل للصحافة",
          "مدخل للإذاعة والتلفزيون",
          "مدخل للعلاقات العامة",
          "المدخل للوسائط المتعددة"
        ],
        "الثاني": [
          "لغة إنجليزية 2",
          "تطبيقات الحاسوب 2",
          "مدخل لعلم الاتصال",
          "تاريخ الإعلام السوداني",
          "الوسائط المتعددة",
          "علم النفس الإعلامي"
        ]
      },
      "الثانية": {
        "الثالث": [
          "تكنولوجيا الإتصال",
          "نظريات الاتصال",
          "الراي العام و الدعاية",
          "الإعلام السياحي",
          "وكالات الأنباء و مصادر المعلومات",
          "الإعلان والتسويق",
          "الإعلام الجديد و تطبيقاته"
        ],
        "الرابع": [
          "اللغة العربية للأغراض الإعلامية",
          "مدخل للترجمة الإعلامية",
          "الإعلام وقضايا المجتمع",
          "سيسلوجيا الاتصال",
          "إدارة المؤسسات الإعلامية",
          "الاتصال التنموي",
          "إقتصاديات الإعلام"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "مناهج البحث العلمي",
          "التشريعات الإعلامية",
          "الإعلام التربوي",
          "إعداد و تقديم البرامج الحوارية",
          "الوسائط المتعددة 2",
          "الإتصال الدولي",
          "الإحصاء"
        ],
        "السادس": [
          "العلاقات العامة و الصورة الذهنية",
          "العلاقات العامة الالكترونية",
          "تخطيط برامج العلاقات العامة",
          "انشطة وبرامج العلاقات العامة",
          "التسويق المتقدم",
          "التصوير الرقمي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "المراسم و البروتكول",
          "العلاقات العامة وإدارة الأزمات",
          "الفيلم الوثائقي",
          "بحوث العلاقات العامة",
          "العلاقات العامة في السودان",
          "إدارة الوقت",
          "بحث التخرج 1"
        ],
        "الثامن": [
          "العلاقات العامة الدولية",
          "إدارة قسم العلاقات العامة",
          "الإتجاهات الحديثة في العلاقات العامة",
          "الاتصال التنظيمي",
          "التسويق المتقدم",
          "مشروع التخرج"
        ]
      }
    },
    "تخصص الإذاعة والتلفاز": {
      "الأولى": {
        "الأول": [
          "لغة إنجليزية 1",
          "تطبيقات الحاسوب 1",
          "مدخل للصحافة",
          "مدخل للإذاعة والتلفزيون",
          "مدخل للعلاقات العامة",
          "المدخل للوسائط المتعددة"
        ],
        "الثاني": [
          "لغة إنجليزية 2",
          "تطبيقات الحاسوب 2",
          "مدخل لعلم الاتصال",
          "تاريخ الإعلام السوداني",
          "الوسائط المتعددة",
          "علم النفس الإعلامي"
        ]
      },
      "الثانية": {
        "الثالث": [
          "تكنولوجيا الإتصال",
          "نظريات الاتصال",
          "الراي العام و الدعاية",
          "الإعلام السياحي",
          "وكالات الأنباء و مصادر المعلومات",
          "الإعلان والتسويق",
          "الإعلام الجديد و تطبيقاته"
        ],
        "الرابع": [
          "اللغة العربية للأغراض الإعلامية",
          "مدخل للترجمة الإعلامية",
          "الإعلام وقضايا المجتمع",
          "سيسلوجيا الاتصال",
          "إدارة المؤسسات الإعلامية",
          "الاتصال التنموي",
          "إقتصاديات الإعلام"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "مناهج البحث العلمي",
          "التشريعات الإعلامية",
          "الإعلام التربوي",
          "إعداد وتقديم البرامج الحوارية",
          "الوسائط المتعددة 2",
          "الإتصال الدولي",
          "الإحصاء"
        ]
      },
      "الثالث": {
        "السادس": [
          "الإذاعات المتخصصة",
          "قضايا إعلامية معاصرة",
          "التوثيق الإعلامي",
          "نظم الاتصال",
          "إدارة المؤسسات الإعلامية",
          "كتابة السناريو",
          "بحوث جمهور الإذاعة والتلفزيون"
        ]
      },
      "الرابعة": {
        "السابع": [
          "التخطيط الإذاعي والتلفزيوني",
          "الكتابة للراديو و التلفزيون",
          "إنتاج البرامج الإذاعية",
          "فن الالقاء الإذاعي والتلفزيوني",
          "الإخراج الإذاعي"
        ],
        "الثامن": [
          "الدراما",
          "الفيلم الوثائقي",
          "هندسة و تشغيل الأستديوهات",
          "مشروع التخرج"
        ]
      }
    },
    "تخصص الصحافة والنشر": {
      "الأولى": {
        "الأول": [
          "لغة إنجليزية 1",
          "تطبيقات الحاسوب 1",
          "مدخل للصحافة",
          "مدخل للإذاعة والتلفزيون",
          "مدخل للعلاقات العامة",
          "المدخل للوسائط المتعددة"
        ],
        "الثاني": [
          "لغة إنجليزية 2",
          "تطبيقات الحاسوب 2",
          "مدخل لعلم الاتصال",
          "تاريخ الإعلام السوداني",
          "الوسائط المتعددة",
          "علم النفس الإعلامي"
        ]
      },
      "الثانية": {
        "الثالث": [
          "تكنولوجيا الإتصال",
          "نظريات الاتصال",
          "الراي العام و الدعاية",
          "الإعلام السياحي",
          "وكالات الأنباء و مصادر المعلومات",
          "الإعلان والتسويق",
          "الإعلام الجديد و تطبيقاته"
        ],
        "الرابع": [
          "اللغة العربية للأغراض الإعلامية",
          "مدخل للترجمة الإعلامية",
          "الإعلام وقضايا المجتمع",
          "سيسلوجيا الاتصال",
          "إدارة المؤسسات الإعلامية",
          "الاتصال التنموي",
          "إقتصاديات الإعلام"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "مناهج البحث العلمي",
          "التشريعات الإعلامية",
          "الاعلام التربوي",
          "إعداد وتقديم البرامج الحوارية",
          "الوسائط المتعددة 2",
          "الإتصال الدولي",
          "الإحصاء"
        ],
        "السادس": [
          "الإخراج الصحفي 1",
          "النشر الالكتروني",
          "الصحافة المتخصصة",
          "التحرير الصحفي",
          "الكتابة الصحفية"
        ]
      },
      "الرابعة": {
        "السابع": [
          "صحافة المجلة",
          "بحوث الصحافة",
          "التصوير الصحفي",
          "الصحافة الالكترونية",
          "الصحافة الدولية",
          "تكنلوجيا الطباعة",
          "بحث التخرج"
        ],
        "الثامن": [
          "اتجاهات الصحافة الحديثة",
          "الحملات الصحفية",
          "التحرير الصحفي 2",
          "الصحافة الاستقصائية",
          "الطباعة والتصميم",
          "الاخراج الصحفي 2",
          "مشروع التخرج"
        ]
      }
    }
  },
  "بكالوريوس العلوم الإدارية": {
    "المحاسبة والتمويل": {
      "الأولى": {
        "الأول": [
          "مبادئ القانون",
          "مقدمة في علوم الحاسوب",
          "اللغة الإنجليزية للأعمال 1",
          "رياضيات الأعمال 1",
          "مبادئ الاقتصاد",
          "المحاسبة المالية 1",
          "مبادئ الإدارة 1"
        ],
        "الثاني": [
          "مبادئ التأمين",
          "مبادئ الإحصاء",
          "اللغة الإنجليزية للأعمال 2",
          "المحاسبة المالية 2",
          "مبادئ الإدارة 2",
          "تطبيقات الحاسوب 1",
          "رياضيات الأعمال 2"
        ]
      },
      "الثانية": {
        "الثالث": [
          "نظم المعلومات الإدارية",
          "أخلاقيات العمل والمسؤولية الاجتماعية",
          "السلوك التنظيمي",
          "المحاسبة المتوسطة 1",
          "الاقتصاد الكلى",
          "الإحصاء الإداري",
          "تطبيقات الحاسوب 2"
        ],
        "الرابع": [
          "الطرق الكمية",
          "القانون التجاري",
          "فقه المعاملات",
          "محاسبة التكاليف",
          "النقود والبنوك",
          "المحاسبة المتوسطة 2",
          "مهارات المقال وكتابة التقارير"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "تمويل الشركات",
          "محاسبة شركات التأمين",
          "المراجعة",
          "التحليل المالي",
          "نظم محاسبة التكاليف",
          "تطبيقات الحاسوب في المحاسبة",
          "محاسبة البنوك"
        ],
        "السادس": [
          "المعايير المحاسبية",
          "محاسبة الضرائب والزكاة",
          "اللغة الإنجليزية للمحاسبة",
          "مناهج البحث العلمي",
          "المحاسبة الإدارية",
          "الاسواق المالية",
          "المحاسبة الحكومية والقومية"
        ]
      },
      "الرابعة": {
        "السابع": [
          "المحاسبة المالية المتقدمة 1",
          "الإدارة المالية",
          "التأمين وإدارة المخاطر",
          "التقارير المالية",
          "محاسبة إدارية متقدمة",
          "المراجعة المتقدمة",
          "المحاسبة المالية المتقدمة 2"
        ],
        "الثامن": [
          "قضايا محاسبية معاصرة",
          "المحاسبة الإلكترونية",
          "محاسبة النفط والغاز",
          "نظرية المحاسبة",
          "الاستثمار وإدارة المحافظ",
          "بحث التخرج",
          "التخطيط والرقابة المالية"
        ]
      }
    },
    "البنوك والتمويل": {
      "الأولى": {
        "الأول": [
          "مبادئ القانون",
          "مقدمة في علوم الحاسوب",
          "اللغة الإنجليزية للأعمال 1",
          "رياضيات الأعمال 1",
          "مبادئ الاقتصاد",
          "المحاسبة المالية 1",
          "مبادئ الإدارة 1"
        ],
        "الثاني": [
          "مبادئ التأمين",
          "مبادئ الإحصاء",
          "اللغة الإنجليزية للأعمال 2",
          "المحاسبة المالية 2",
          "مبادئ الإدارة 2",
          "تطبيقات الحاسوب 1",
          "رياضيات الأعمال 2"
        ]
      },
      "الثانية": {
        "الثالث": [
          "نظم المعلومات الإدارية",
          "أخلاقيات العمل والمسؤولية الاجتماعية",
          "السلوك التنظيمي",
          "المحاسبة المتوسطة 1",
          "الاقتصاد الكلى",
          "الإحصاء الإداري",
          "تطبيقات الحاسوب 2"
        ],
        "الرابع": [
          "الطرق الكمية",
          "القانون التجاري",
          "فقه المعاملات",
          "محاسبة التكاليف",
          "النقود والبنوك",
          "المحاسبة المتوسطة 2",
          "مهارات المقال وكتابة التقارير"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "محاسبة المصارف",
          "قانون البنوك",
          "الاقتصاد النقدي",
          "نظم المعلومات المصرفية",
          "المؤسسات المالية الإسلامية",
          "اللغة الإنجليزية للبنوك",
          "إدارة البنوك"
        ],
        "السادس": [
          "تمويل الشركات",
          "إدارة عمليات التأمين",
          "إدارة المخاطر المصرفية",
          "تطبيقات حاسوبية في المصارف",
          "التمويل الأصغر",
          "مناهج البحث العلمي",
          "الأسواق المالية"
        ]
      },
      "الرابعة": {
        "السابع": [
          "الإدارة المالية",
          "التقارير المالية",
          "التمويل الشخصي",
          "أعمال البنوك",
          "تسويق الخدمات المصرفية",
          "التجارة الخارجية",
          "نظم الأعمال والتجارة الإلكترونية"
        ],
        "الثامن": [
          "الإستثمار وإدارة المحافظ الاستثمارية",
          "التخطيط والرقابة المالية",
          "بحث التخرج",
          "الصيرفة الإلكترونية",
          "قضايا مصرفية معاصرة",
          "دراسة الجدوى وتقييم المشروعات"
        ]
      }
    },
    "إدارة الأعمال": {
      "الأولى": {
        "الأول": [
          "مبادئ القانون",
          "مقدمة في علوم الحاسوب",
          "اللغة الإنجليزية للأعمال 1",
          "رياضيات الأعمال 1",
          "مبادئ الاقتصاد",
          "المحاسبة المالية 1",
          "مبادئ الإدارة 1"
        ],
        "الثاني": [
          "مبادئ التأمين",
          "مبادئ الإحصاء",
          "اللغة الإنجليزية للأعمال 2",
          "المحاسبة المالية 2",
          "مبادئ الإدارة 2",
          "تطبيقات الحاسوب 1",
          "رياضيات الأعمال 2"
        ]
      },
      "الثانية": {
        "الثالث": [
          "نظم المعلومات الإدارية",
          "أخلاقيات العمل والمسؤولية الاجتماعية",
          "السلوك التنظيمي",
          "المحاسبة المتوسطة 1",
          "الاقتصاد الكلى",
          "الإحصاء الإداري",
          "تطبيقات الحاسوب 2"
        ],
        "الرابع": [
          "الطرق الكمية",
          "القانون التجاري",
          "فقه المعاملات",
          "محاسبة التكاليف",
          "النقود والبنوك",
          "المحاسبة المتوسطة 2",
          "مهارات المقال وكتابة التقارير"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "الاقتصاد الإداري",
          "تطبيقات الحاسوب في الإدارة",
          "الإتصال الإداري",
          "إدارة المعرفة",
          "إدارة الموارد البشرية",
          "دراسة الجدوى وتقييم المشروعات",
          "نظم دعم القرار"
        ],
        "السادس": [
          "المحاسبة الإدارية",
          "التأمين وإدارة المخاطر",
          "اللغة الإنجليزية لإدارة الأعمال",
          "الإدارة الإلكترونية",
          "إدارة المشتريات والمخازن",
          "إدارة سلاسل الإمداد",
          "مناهج البحث العلمي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "ريادة الأعمال",
          "بحوث التسويق",
          "الإدارة المالية",
          "بحوث العمليات",
          "استراتيجيات التسويق",
          "إدارة المؤسسات المالية"
        ],
        "الثامن": [
          "الإدارة الاستراتيجية",
          "إدارة الجودة الشاملة",
          "إدارة الأعمال الدولية",
          "القيادة الإدارية",
          "مهارات التفاوض وإدارة الصراع",
          "بحث التخرج"
        ]
      }
    },
    "التسويق": {
      "الأولى": {
        "الأول": [
          "مبادئ القانون",
          "مقدمة في علوم الحاسوب",
          "اللغة الإنجليزية للأعمال 1",
          "رياضيات الأعمال 1",
          "مبادئ الاقتصاد",
          "المحاسبة المالية 1",
          "مبادئ الإدارة 1"
        ],
        "الثاني": [
          "مبادئ التأمين",
          "مبادئ الإحصاء",
          "اللغة الإنجليزية للأعمال 2",
          "المحاسبة المالية 2",
          "مبادئ الإدارة 2",
          "تطبيقات الحاسوب 1",
          "رياضيات الأعمال 2"
        ]
      },
      "الثانية": {
        "الثالث": [
          "نظم المعلومات الإدارية",
          "أخلاقيات العمل والمسؤولية الاجتماعية",
          "السلوك التنظيمي",
          "المحاسبة المتوسطة 1",
          "الاقتصاد الكلى",
          "الإحصاء الإداري",
          "تطبيقات الحاسوب 2"
        ],
        "الرابع": [
          "الطرق الكمية",
          "القانون التجاري",
          "فقه المعاملات",
          "محاسبة التكاليف",
          "النقود والبنوك",
          "المحاسبة المتوسطة 2",
          "مهارات المقال وكتابة التقارير"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "الاقتصاد الإداري",
          "إدارة المنتج والعلامة التجارية",
          "دراسة الجدوى وتقييم المشروعات",
          "إدارة الموارد البشرية",
          "التجارة الإلكترونية",
          "اللغة الإنجليزية للتسويق",
          "نظم المعلومات التسويقية"
        ],
        "السادس": [
          "المحاسبة الإدارية",
          "إدارة الأعمال الدولية",
          "إدارة التسعير",
          "سلوك المستهلك",
          "القانون الإلكتروني",
          "مناهج البحث العلمي",
          "إدارة المبيعات"
        ]
      },
      "الرابعة": {
        "السابع": [
          "المحاسبة الإدارية المتقدمة",
          "الإدارة الاستراتيجية",
          "التسويق الدولي",
          "الإدارة المالية",
          "التسويق الإلكتروني",
          "الاتصالات التسويقية المتكاملة"
        ],
        "الثامن": [
          "استراتيجيات التسويق",
          "التسويق الإبتكاري",
          "إدارة تسويق الخدمات",
          "إدارة التوزيع",
          "قضايا تسويقية معاصرة",
          "بحث التخرج"
        ]
      }
    }
  },
  "بكالوريوس علوم المختبرات الطبية": {
    "علم الأحياء الدقيقة": {
      "الأولى": {
        "الأول": [
          "علم وظائف الأعضاءI",
          "اللغة الإنجليزية للأغراض المتخصصة Ι",
          "التشريح البشري I",
          "مقدمة في علوم المختبرات الطبية",
          "Ιالكيمياء الحيوية",
          "الكيمياء العامة",
          "احيائية الخلية"
        ],
        "الثاني": [
          "اللغة الإنجليزية للأغراض المتخصصة II",
          "المجاهر",
          "ΙΙ الكيمياء الحيوية",
          "الفيزياْء العامة",
          "علم وظائف الأعضاء II",
          "التشريح البشري ΙΙ",
          "السلامة في المختبر"
        ]
      },
      "الثانية": {
        "الثالث": [
          "علم الأحياء الدقيقة العام I",
          "أساسيات علم الدم",
          "أساسيات الكيمياء السريرية Ι",
          "تقنيات علم أمراض الانسجة Ι",
          "علم الامراض العام",
          "علم الأوليات الطبية",
          "تطبيقات الحاسوب"
        ],
        "الرابع": [
          "علم الأحياء الدقيقة العام II",
          "علم المناعة الدموية وتخثر الدم",
          "أساسيات الكيمياء السريرية IΙ",
          "علم الأنسجة",
          "علم الحشرات الطبية",
          "أساسيات علم المناعة",
          "الدراسات السودانية"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "علم البكتريا الطبية I",
          "أمراض خلايا الدم الحمراء والمناعة الدموية",
          "فسيولوجيا وامراض الكلى والشوارد الكهربائية",
          "تقنيات علم أمراض الانسجة IΙ",
          "الديدان المفلطحة",
          "علم المناعة السريرية",
          "علم الأحياء الجزيئية"
        ],
        "السادس": [
          "علم البكتريا الطبية II",
          "إختلالات خلايا الدم البيضاءI",
          "فسيولوجيا وأمراض الكبد والدهون",
          "علم الخلايا",
          "الديدان الأسطوانية",
          "الإحصاء الحيوي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "Ι علم الاحياء الدقيقة الجهازي",
          "علم الفطريات الطبية",
          "علم الأوبئة",
          "التقنيات الجزيئية",
          "الأجهزة والأتمتة",
          "أدارة المختبر",
          "التدريب الحقلي",
          "مشروع التخرج",
          "طرائق البحث"
        ],
        "الثامن": [
          "علم الاحياء الدقيقة الجهازي ΙΙ",
          "علم الفيروسات الطبية",
          "أخلاقيات المهنة",
          "ضمان الجودة الشاملة",
          "المعلوماتية الحيوية",
          "التدريب الحقلي",
          "مشروع التخرج"
        ]
      }
    },
    "علم الدم والمناعة الدموية": {
      "الأولى": {
        "الأول": [
          "علم وظائف الأعضاءI",
          "اللغة الإنجليزية للأغراض المتخصصة Ι",
          "التشريح البشري I",
          "مقدمة في علوم المختبرات الطبية",
          "Ιالكيمياء الحيوية",
          "الكيمياء العامة",
          "احيائية الخلية"
        ],
        "الثاني": [
          "اللغة الإنجليزية للأغراض المتخصصة II",
          "المجاهر",
          "ΙΙ الكيمياء الحيوية",
          "الفيزياْء العامة",
          "علم وظائف الأعضاء II",
          "التشريح البشري ΙΙ",
          "السلامة في المختبر"
        ]
      },
      "الثانية": {
        "الثالث": [
          "علم الأحياء الدقيقة العام I",
          "أساسيات علم الدم",
          "أساسيات الكيمياء السريرية Ι",
          "تقنيات علم أمراض الانسجة Ι",
          "علم الامراض العام",
          "علم الأوليات الطبية",
          "تطبيقات الحاسوب"
        ],
        "الرابع": [
          "علم الأحياء الدقيقة العام II",
          "علم المناعة الدموية وتخثر الدم",
          "أساسيات الكيمياء السريرية IΙ",
          "علم الأنسجة",
          "علم الحشرات الطبية",
          "أساسيات علم المناعة",
          "الدراسات السودانية"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "علم البكتريا الطبية I",
          "أمراض خلايا الدم الحمراء والمناعة الدموية",
          "فسيولوجيا وامراض الكلى والشوارد الكهربائية",
          "تقنيات علم أمراض الانسجة IΙ",
          "الديدان المفلطحة",
          "علم المناعة السريرية",
          "علم الأحياء الجزيئية"
        ],
        "السادس": [
          "علم البكتريا الطبية II",
          "إختلالات خلايا الدم البيضاءI",
          "فسيولوجيا وأمراض الكبد والدهون",
          "علم الخلايا",
          "الديدان الأسطوانية"
        ]
      },
      "الرابعة": {
        "السابع": [
          "إعتلالات كريات الدم الحمراء المتقدمة",
          "بنك الدم المتقدم",
          "علم الاوبئة",
          "التقنيات الجزيئية",
          "الأجهزة والأتمتة",
          "إدارة المختبر",
          "التدريب الحقلي",
          "مشروع التخرج",
          "طرائق البحث"
        ],
        "الثامن": [
          "إعتلالات كريات الدم البيضاء المتقدمة",
          "فسيولوجيا و أمراض الصفائح الدموية و تخثر الدم",
          "أخلاقيات المهنة",
          "ضمان الجودة الشاملة",
          "المعلوماتية الحيوية",
          "التدريب الحقلي",
          "مشروع التخرج"
        ]
      }
    },
    "الكيمياء السريرية": {
      "الأولى": {
        "الأول": [
          "علم وظائف الأعضاءI",
          "اللغة الإنجليزية للأغراض المتخصصة Ι",
          "التشريح البشري I",
          "مقدمة في علوم المختبرات الطبية",
          "Ιالكيمياء الحيوية",
          "الكيمياء العامة",
          "احيائية الخلية"
        ],
        "الثاني": [
          "اللغة الإنجليزية للأغراض المتخصصة II",
          "المجاهر",
          "ΙΙ الكيمياء الحيوية",
          "الفيزياْء العامة",
          "علم وظائف الأعضاء II",
          "التشريح البشري ΙΙ",
          "السلامة في المختبر"
        ]
      },
      "الثانية": {
        "الثالث": [
          "علم الأحياء الدقيقة العام I",
          "أساسيات علم الدم",
          "أساسيات الكيمياء السريرية Ι",
          "تقنيات علم أمراض الانسجة Ι",
          "علم الامراض العام",
          "علم الأوليات الطبية",
          "تطبيقات الحاسوب"
        ],
        "الرابع": [
          "علم الأحياء الدقيقة العام II",
          "علم المناعة الدموية وتخثر الدم",
          "أساسيات الكيمياء السريرية IΙ",
          "علم الأنسجة",
          "علم الحشرات الطبية",
          "أساسيات علم المناعة",
          "الدراسات السودانية"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "علم البكتريا الطبية I",
          "أمراض خلايا الدم الحمراء والمناعة الدموية",
          "فسيولوجيا وامراض الكلى والشوارد الكهربائية",
          "تقنيات علم أمراض الانسجة IΙ",
          "الديدان المفلطحة",
          "علم المناعة السريرية",
          "علم الأحياء الجزيئية"
        ],
        "السادس": [
          "علم البكتريا الطبية II",
          "إختلالات خلايا الدم البيضاءI",
          "فسيولوجيا وأمراض الكبد والدهون",
          "علم الخلايا",
          "الديدان الأسطوانية",
          "الإحصاء الحيوي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "علم الانزيمات والفايتمينات",
          "علم السموم ومراقبة الأدوية",
          "علم الاوبئة",
          "التقنيات الجزيئية",
          "الأجهزة والأتمتة",
          "إدارة المختبر",
          "التدريب الحقلي",
          "مشروع التخرج",
          "طرائق البحث"
        ],
        "الثامن": [
          "علم الغدد الصماء وواسمات الاورام",
          "ضبط الجودة في الكيمياء السريرية",
          "أخلاقيات المهنة",
          "ضمان الجودة الشاملة",
          "المعلوماتية الحيوية",
          "التدريب الحقلي",
          "مشروع التخرج"
        ]
      }
    },
    "علم الأنسجة المريضة والخلايا": {
      "الأولى": {
        "الأول": [
          "علم وظائف الأعضاءI",
          "اللغة الإنجليزية للأغراض المتخصصة Ι",
          "التشريح البشري I",
          "مقدمة في علوم المختبرات الطبية",
          "Ιالكيمياء الحيوية",
          "الكيمياء العامة",
          "احيائية الخلية"
        ],
        "الثاني": [
          "اللغة الإنجليزية للأغراض المتخصصة II",
          "المجاهر",
          "ΙΙ الكيمياء الحيوية",
          "الفيزياْء العامة",
          "علم وظائف الأعضاء II",
          "التشريح البشري ΙΙ",
          "السلامة في المختبر"
        ]
      },
      "الثانية": {
        "الثالث": [
          "علم الأحياء الدقيقة العام I",
          "أساسيات علم الدم",
          "أساسيات الكيمياء السريرية Ι",
          "تقنيات علم أمراض الانسجة Ι",
          "علم الامراض العام",
          "علم الأوليات الطبية",
          "تطبيقات الحاسوب"
        ],
        "الرابع": [
          "علم الأحياء الدقيقة العام II",
          "علم المناعة الدموية وتخثر الدم",
          "أساسيات الكيمياء السريرية IΙ",
          "علم الأنسجة",
          "علم الحشرات الطبية",
          "أساسيات علم المناعة",
          "الدراسات السودانية"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "علم البكتريا الطبية I",
          "أمراض خلايا الدم الحمراء والمناعة الدموية",
          "فسيولوجيا وامراض الكلى والشوارد الكهربائية",
          "تقنيات علم أمراض الانسجة IΙ",
          "الديدان المفلطحة",
          "علم المناعة السريرية",
          "علم الأحياء الجزيئية"
        ],
        "السادس": [
          "علم البكتريا الطبية II",
          "إختلالات خلايا الدم البيضاءI",
          "فسيولوجيا وأمراض الكبد والدهون",
          "علم الخلايا",
          "الديدان الأسطوانية",
          "الإحصاء الحيوي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "التقنيات المتقدمة في أمراض الانسجة",
          "علم الأمراض والخلايا",
          "علم الأوبئة",
          "التقنيات الجزيئية",
          "الأجهزة والأتمتة",
          "إدارة المختبر",
          "التدريب الحقلي",
          "مشروع التخرج",
          "طرائق البحث"
        ],
        "الثامن": [
          "كيمياء مناعة وانزيمات الانسجة",
          "الوراثة الخلوية",
          "أخلاقيات المهنة",
          "ضمان الجودة الشاملة",
          "المعلوماتية الحيوية",
          "التدريب الحقلي",
          "مشروع التخرج"
        ]
      }
    },
    "علم الطفيليات والحشرات الطبية": {
      "الأولى": {
        "الأول": [
          "علم وظائف الأعضاءI",
          "اللغة الإنجليزية للأغراض المتخصصة Ι",
          "التشريح البشري I",
          "مقدمة في علوم المختبرات الطبية",
          "Ιالكيمياء الحيوية",
          "الكيمياء العامة",
          "احيائية الخلية"
        ],
        "الثاني": [
          "اللغة الإنجليزية للأغراض المتخصصة II",
          "المجاهر",
          "ΙΙ الكيمياء الحيوية",
          "الفيزياْء العامة",
          "علم وظائف الأعضاء II",
          "التشريح البشري ΙΙ",
          "السلامة في المختبر"
        ]
      },
      "الثانية": {
        "الثالث": [
          "علم الأحياء الدقيقة العام I",
          "أساسيات علم الدم",
          "أساسيات الكيمياء السريرية Ι",
          "تقنيات علم أمراض الانسجة Ι",
          "علم الامراض العام",
          "علم الأوليات الطبية",
          "تطبيقات الحاسوب"
        ],
        "الرابع": [
          "علم الأحياء الدقيقة العام II",
          "علم المناعة الدموية وتخثر الدم",
          "أساسيات الكيمياء السريرية IΙ",
          "علم الأنسجة",
          "علم الحشرات الطبية",
          "أساسيات علم المناعة",
          "الدراسات السودانية"
        ]
      },
      "الثالثة": {
        "الخامس": [
          "علم البكتريا الطبية I",
          "أمراض خلايا الدم الحمراء والمناعة الدموية",
          "فسيولوجيا وامراض الكلى والشوارد الكهربائية",
          "تقنيات علم أمراض الانسجة IΙ",
          "الديدان المفلطحة",
          "علم المناعة السريرية",
          "علم الأحياء الجزيئية"
        ],
        "السادس": [
          "علم البكتريا الطبية II",
          "إختلالات خلايا الدم البيضاءI",
          "فسيولوجيا وأمراض الكبد والدهون",
          "علم الخلايا",
          "الديدان الأسطوانية",
          "الإحصاء الحيوي"
        ]
      },
      "الرابعة": {
        "السابع": [
          "علم الحشرات الطبية التطبيقي",
          "علم الطفيليات المناعي والجزيئي",
          "علم الاوبئة",
          "التقنيات الجزيئية",
          "الأجهزة والأتمتة",
          "إدارة المختبر",
          "التدريب الحقلي",
          "مشروع التخرج",
          "طرائق البحث"
        ],
        "الثامن": [
          "علم الطفيليات السريرية المتقدم",
          "علم الطفيليات التشخيصي",
          "أخلاقيات المهنة",
          "ضمان الجودة الشاملة",
          "المعلوماتية الحيوية",
          "التدريب الحقلي",
          "مشروع التخرج"
        ]
      }
    }
  }
};
